{
	"version": "https://jsonfeed.org/version/1",
	"title": "benji",
	"home_page_url": "https://benji.dog",
	"feed_url": "",
	"description": "benji. not the dog.",
	"favicon": "/assets/icons/favicon-64x64.png",
	"icon": "/assets/avatar.png",
	"author": {
		"name": "benji",
		"url": "https://benji.dog",
		"avatar": "https://benji.dog/assets/avatar.png"
	},
	"items": [
		{
			"id": "https://benji.dog/read/1691524542/",
			"url": "https://benji.dog/read/1691524542/",
			"title": "Reading: The Frugal Wizard's Handbook to Surviving Medieval England by Brandon Sanderson",
			"content_text": "Reading: The Frugal Wizard's Handbook to Surviving Medieval England by Brandon Sanderson",
			"date_published": "2023-08-08T19:55:42.218+00:00"
		},
		{
			"id": "https://benji.dog/read/1691524046/",
			"url": "https://benji.dog/read/1691524046/",
			"title": "Read: Yumi and the Nightmare Painter by Brandon Sanderson",
			"content_text": "Read: Yumi and the Nightmare Painter by Brandon Sanderson",
			"date_published": "2023-08-08T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/watched/1691434409-mission-impossible---dead-reckoning-part-one-2023/",
			"url": "https://benji.dog/watched/1691434409-mission-impossible---dead-reckoning-part-one-2023/",
			"title": "Watched Mission: Impossible - Dead Reckoning Part One, (2023) - ★★★★",
			"content_text": "Watched Mission: Impossible - Dead Reckoning Part One, (2023) - ★★★★",
			"date_published": "2023-08-06T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/read/1691161705/",
			"url": "https://benji.dog/read/1691161705/",
			"title": "Reading: Yumi and the Nightmare Painter by Brandon Sanderson",
			"content_text": "Reading: Yumi and the Nightmare Painter by Brandon Sanderson",
			"date_published": "2023-08-04T15:08:25.488+00:00"
		},
		{
			"id": "https://benji.dog/read/1691161682/",
			"url": "https://benji.dog/read/1691161682/",
			"title": "Read: Housekeeping by Marilynne Robinson",
			"content_text": "Read: Housekeeping by Marilynne Robinson",
			"date_published": "2023-08-04T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/read/1690944492/",
			"url": "https://benji.dog/read/1690944492/",
			"title": "Reading: Housekeeping by Marilynne Robinson",
			"content_text": "Reading: Housekeeping by Marilynne Robinson",
			"date_published": "2023-08-02T02:48:12.129+00:00"
		},
		{
			"id": "https://benji.dog/watched/1691263525-barbie-2023/",
			"url": "https://benji.dog/watched/1691263525-barbie-2023/",
			"title": "Watched Barbie, (2023) - ★★★★★",
			"content_text": "Watched Barbie, (2023) - ★★★★★",
			"date_published": "2023-08-02T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/read/1690944436/",
			"url": "https://benji.dog/read/1690944436/",
			"title": "Read: The vanished birds by Simon Jimenez",
			"content_text": "Read: The vanished birds by Simon Jimenez",
			"date_published": "2023-08-01T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/likes/why-i-blog/",
			"url": "https://benji.dog/likes/why-i-blog/",
			"title": "Liked \"Why I Blog?\"",
			"content_text": "Liked \"Why I Blog?\"",
			"date_published": "2023-07-21T00:01:40.353+00:00"
		},
		{
			"id": "https://benji.dog/watched/1689906671-upstream-color-2013/",
			"url": "https://benji.dog/watched/1689906671-upstream-color-2013/",
			"title": "Rewatched Upstream Color, (2013) - ★★★★",
			"content_text": "Rewatched Upstream Color, (2013) - ★★★★",
			"date_published": "2023-07-18T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/watched/1689659669-parallel-mothers-2021/",
			"url": "https://benji.dog/watched/1689659669-parallel-mothers-2021/",
			"title": "Watched Parallel Mothers, (2021) - ★★★",
			"content_text": "Watched Parallel Mothers, (2021) - ★★★",
			"date_published": "2023-07-17T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/notes/1689447158/",
			"url": "https://benji.dog/notes/1689447158/",
			"title": "Reply to https://www.manton.org/2023/07/15/we-finally-installed.html",
			"content_text": "I'm happy to know this isn't just me. I've had a fire alarm waiting to be installed for 6 months now but that's future benji's problem.",
			"date_published": "2023-07-15T18:52:38.269+00:00",
			"tags": [
				"future benji"
			]
		},
		{
			"id": "https://benji.dog/watched/1689278548-cosmopolis-2012/",
			"url": "https://benji.dog/watched/1689278548-cosmopolis-2012/",
			"title": "Watched Cosmopolis, (2012) - ★★",
			"content_text": "I didn't dislike this. I also didn't like it. It was a pain to get through but I think that's on purpose. This is only my second Cronenberg film which is surprising given how many times I've watched The Fly (1986).",
			"date_published": "2023-07-13T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/watched/1689105748-tokyo-2008/",
			"url": "https://benji.dog/watched/1689105748-tokyo-2008/",
			"title": "Watched Tokyo!, (2008) - ★★★",
			"content_text": "Parts 1 and 3 were very interesting and different from each other while still feeling that they were about people. I'm glad I saw Holy Motors (2012) before this. I would not have wanted to see any more of &quot;Merde&quot; if this was my introduction to him. Bong Joon Ho's was my favorite of the three.",
			"date_published": "2023-07-11T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/read/1688936566/",
			"url": "https://benji.dog/read/1688936566/",
			"title": "Reading: The vanished birds by Simon Jimenez",
			"content_text": "Reading: The vanished birds by Simon Jimenez",
			"date_published": "2023-07-09T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/read/1688935052/",
			"url": "https://benji.dog/read/1688935052/",
			"title": "Read: The Hobbit by J.R.R. Tolkien",
			"content_text": "Read: The Hobbit by J.R.R. Tolkien",
			"date_published": "2023-07-09T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/watched/1688834734-in-the-mood-for-love-2000/",
			"url": "https://benji.dog/watched/1688834734-in-the-mood-for-love-2000/",
			"title": "Watched In the Mood for Love, (2000) - ★★★★★",
			"content_text": "Watched In the Mood for Love, (2000) - ★★★★★",
			"date_published": "2023-07-08T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/read/1688675852/",
			"url": "https://benji.dog/read/1688675852/",
			"title": "Read: Norse Mythology by Neil Gaiman",
			"content_text": "Read: Norse Mythology by Neil Gaiman",
			"date_published": "2023-07-06T00:00:00.000Z"
		},
		{
			"id": "https://benji.dog/articles/films-to-be-buried-with/",
			"url": "https://benji.dog/articles/films-to-be-buried-with/",
			"title": "Films To Be Buried With",
			"content_text": "Being a huge movie fan, I've really enjoyed listening to the podcast Films To Be Buried With. Whenever I listen to an episode I always think I have some answers to the questions Brett Goldstein asks the guests. The basic premise of the podcast if you haven't listened to it is the following: You have died and go to heaven and people there want to know about your life through film. The following are the questions that are asked with my answers. 1. First film you remember seeing My grandmother had a laserdisc copy of Batman (1989) and while I don't remember sitting down and watching it, I do remember asking to watch it and some images here and there. My first movie theater experience I remember was Casper (1995). 2. Scariest film you've ever seen I'm not a huge fan of horror films but I have watched a few in my time. The Exorcist (1973) is amazing and I remember the whole watching experience when I was about 12 years old. While not really a horror movie, Requiem for a Dream (2000) scared me more than anything else I have ever seen. I've watched it once but I still remember every detail of that movie and even though I consider it to be a great film, I'll probably never watch it again. 3. The film that made you cry the most My wife will say I'm not a sad movie crier and instead a happy movie crier. The saddest movie I watched is probably Grave of the Fireflies (1988) but I dont remember crying. I might just not remember because of how many other emotions I had at the end of that movie. There's a lot of movies designed to make you happy cry and whatever that genre is called, I approve. The speech at the end of Jerry Maguire (1996) always gets me and even though I know its coming every time I watch this, I still can't help but tear up listening to it. 4. Critically bad film that you love I rewatch Hackers (1995) at least once a year. It has a 32% rotten tomatoes and 6.2/10 on IMDB which I've never understood. Even in the past few years I feel like there has been a larger group of people that have gone from liking the movie ironically to actually enjoying it. I watched this in '98 and have been hooked since. I think people get caught up with the way the hacking scenes are shown but even then knowing how unrealistic it was, it made sense as to why they're doing it. Typing code is visually boring and in a movie with so much flashy sets and costumes, showing a black terminal with white text while realistic would not have matched well with the rest of the aesthetic. I also miss payphones and floppy disks and there's plenty of both here. 5. Film you loved ages ago but you watched recently and it's not that great It's been a while so &quot;recently&quot; isn't entirely accurate but I think it would have to be Revenge of the Nerds (1984). This movie played consistently on TV when I was a younger and I would watch it whenever that would happen. The musical bit near the end was one of my favorite parts. It wasn't until a few years ago me and some friends found we all shared similar nostalgic feelings towards this movie so planned for a movie night and while watching it we realize just how much horrible stuff is actually happening. The 80's were weird. 6. Film with a lot of meaning to you, given the circumstances of the viewing Right after highschool but before moving to the US for university my friends and I would go to the movies weekly. Tuesdays were 2 for 1 so pretty good deal even considering the cost of movie tickets in Ecuador back then. The last movie we watched before we all moved away to different cities was Brokeback Mountain (2005). I love that movie for a million reasons but it also holds all the memories of a very specific moment in my life which I'll always cherish. 7. Sexiest film you've ever seen The obvious answer here has to be Y tu mamá también (2001). Even if you skip all the sex scenes its hard not to find the rest of the movie sexy. On top of that, to me this has one of the greatest movie endings of all time. The less obvious answer (which is also part of the questions asked in the podcast) is Chef (2014). Watch the Pasta Aglio e Olio scene and tell me I'm wrong. 8. Most relatable film This was one of the ones I knew the answer for sure and it was Forgetting Sarah Marshall (2008). Its not a feeling I relate to now but for the longest I really felt a very specific way that this movie depicted fairly accurately. That was true until I watched Aftersun (2022). I don't want to get into spoilers since this is fairly new but I can see myself in both characters at different times of my life and theirs. 9. Film that made you laugh the most There wasn't a movie theater in the city I grew up in but whenever we would visit Guayaquil my mom, brother, and I went to the movies. One of these times we picked Dodgeball: A True Underdog Story (2004). The &quot;If you can dodge a wrench, you can dodge a ball!&quot; scene caught me completely off guard and when it happened I lost it. It helps that I laugh silently so at least I wasn't annoying people but breathing is important and that was very difficult. 10. Worst film of all time A friend recommended I watch The Room (2003) as they had just been to one of the midnight shows and had loved the experience. It was pitched to me like a movie that's so bad its funny but I think it benefits from a crowd. Watching this alone on my laptop is about the saddest movie watching experience and nothing at all was funny or interesting to me. I've watched some bad movies but this one is rough. 11. Objectively best film of all time I keep coming back to this since there's a bunch of movies that would be the right answer. In the end I think The Prestige (2006) is my answer because I remember watching it the first time and thinking how great it was. The second time I watched it, it was even better because now I was trying to catch the reveals from the first viewing. And Bowie as Tesla. 12. Film you could watch again and again My wife and I have different movie tastes but we usually try to watch The Fifth Element (1997) and Rogue One (2016) at least once a year. I think its impossible to get tired of watching The Fifth Element. Fun SciFi movie with a great cast and music and the attention to detail in the world built for it always has me feeling like I'm seeing new things for the first time. 13. Film to be buried with The Brothers Bloom (2008) could easily answer most of the other questions from above but I felt like this would be best for the end. It has a wonderful cast, magic, crime, a sibling relationship, mystery, romance, comedy, friendship. I'm sure there are many flaws with it but the good things in this movie are really good to me and I would hope sharing it through this medium might help others see it much the same way. -- That's my list. I've had this in multiple states of drafted since I talked about this over a year ago at a Homebrew Website Club meeting and I'm happy I've finally finished it.",
			"date_published": "2023-07-04T00:00:00.000Z",
			"tags": [
				"movies"
			]
		},
		{
			"id": "https://benji.dog/read/1688487454/",
			"url": "https://benji.dog/read/1688487454/",
			"title": "Read: El amor en los tiempos del cólera by Gabriel García Márquez",
			"content_text": "Read: El amor en los tiempos del cólera by Gabriel García Márquez",
			"date_published": "2023-07-03T00:00:00.000Z"
		}
	]
}