{
	"version": "https://jsonfeed.org/version/1",
	"title": "benji",
	"home_page_url": "https://benji.dog",
	"feed_url": "",
	"description": "benji. not the dog.",
	"favicon": "/assets/icons/favicon-64x64.png",
	"icon": "/assets/avatar.png",
	"author": {
		"name": "benji",
		"url": "https://benji.dog",
		"avatar": "https://benji.dog/assets/avatar.png"
	},
	"items": [
		{
			"id": "https://benji.dog/notes/1689447158/",
			"url": "https://benji.dog/notes/1689447158/",
			"title": "Reply to https://www.manton.org/2023/07/15/we-finally-installed.html",
			"content_text": "I'm happy to know this isn't just me. I've had a fire alarm waiting to be installed for 6 months now but that's future benji's problem.",
			"date_published": "2023-07-15T18:52:38.269+00:00",
			"tags": [
				"future benji"
			]
		},
		{
			"id": "https://benji.dog/articles/films-to-be-buried-with/",
			"url": "https://benji.dog/articles/films-to-be-buried-with/",
			"title": "Films To Be Buried With",
			"content_text": "Being a huge movie fan, I've really enjoyed listening to the podcast Films To Be Buried With. Whenever I listen to an episode I always think I have some answers to the questions Brett Goldstein asks the guests. The basic premise of the podcast if you haven't listened to it is the following: You have died and go to heaven and people there want to know about your life through film. The following are the questions that are asked with my answers. 1. First film you remember seeing My grandmother had a laserdisc copy of Batman (1989) and while I don't remember sitting down and watching it, I do remember asking to watch it and some images here and there. My first movie theater experience I remember was Casper (1995). 2. Scariest film you've ever seen I'm not a huge fan of horror films but I have watched a few in my time. The Exorcist (1973) is amazing and I remember the whole watching experience when I was about 12 years old. While not really a horror movie, Requiem for a Dream (2000) scared me more than anything else I have ever seen. I've watched it once but I still remember every detail of that movie and even though I consider it to be a great film, I'll probably never watch it again. 3. The film that made you cry the most My wife will say I'm not a sad movie crier and instead a happy movie crier. The saddest movie I watched is probably Grave of the Fireflies (1988) but I dont remember crying. I might just not remember because of how many other emotions I had at the end of that movie. There's a lot of movies designed to make you happy cry and whatever that genre is called, I approve. The speech at the end of Jerry Maguire (1996) always gets me and even though I know its coming every time I watch this, I still can't help but tear up listening to it. 4. Critically bad film that you love I rewatch Hackers (1995) at least once a year. It has a 32% rotten tomatoes and 6.2/10 on IMDB which I've never understood. Even in the past few years I feel like there has been a larger group of people that have gone from liking the movie ironically to actually enjoying it. I watched this in '98 and have been hooked since. I think people get caught up with the way the hacking scenes are shown but even then knowing how unrealistic it was, it made sense as to why they're doing it. Typing code is visually boring and in a movie with so much flashy sets and costumes, showing a black terminal with white text while realistic would not have matched well with the rest of the aesthetic. I also miss payphones and floppy disks and there's plenty of both here. 5. Film you loved ages ago but you watched recently and it's not that great It's been a while so &quot;recently&quot; isn't entirely accurate but I think it would have to be Revenge of the Nerds (1984). This movie played consistently on TV when I was a younger and I would watch it whenever that would happen. The musical bit near the end was one of my favorite parts. It wasn't until a few years ago me and some friends found we all shared similar nostalgic feelings towards this movie so planned for a movie night and while watching it we realize just how much horrible stuff is actually happening. The 80's were weird. 6. Film with a lot of meaning to you, given the circumstances of the viewing Right after highschool but before moving to the US for university my friends and I would go to the movies weekly. Tuesdays were 2 for 1 so pretty good deal even considering the cost of movie tickets in Ecuador back then. The last movie we watched before we all moved away to different cities was Brokeback Mountain (2005). I love that movie for a million reasons but it also holds all the memories of a very specific moment in my life which I'll always cherish. 7. Sexiest film you've ever seen The obvious answer here has to be Y tu mamá también (2001). Even if you skip all the sex scenes its hard not to find the rest of the movie sexy. On top of that, to me this has one of the greatest movie endings of all time. The less obvious answer (which is also part of the questions asked in the podcast) is Chef (2014). Watch the Pasta Aglio e Olio scene and tell me I'm wrong. 8. Most relatable film This was one of the ones I knew the answer for sure and it was Forgetting Sarah Marshall (2008). Its not a feeling I relate to now but for the longest I really felt a very specific way that this movie depicted fairly accurately. That was true until I watched Aftersun (2022). I don't want to get into spoilers since this is fairly new but I can see myself in both characters at different times of my life and theirs. 9. Film that made you laugh the most There wasn't a movie theater in the city I grew up in but whenever we would visit Guayaquil my mom, brother, and I went to the movies. One of these times we picked Dodgeball: A True Underdog Story (2004). The &quot;If you can dodge a wrench, you can dodge a ball!&quot; scene caught me completely off guard and when it happened I lost it. It helps that I laugh silently so at least I wasn't annoying people but breathing is important and that was very difficult. 10. Worst film of all time A friend recommended I watch The Room (2003) as they had just been to one of the midnight shows and had loved the experience. It was pitched to me like a movie that's so bad its funny but I think it benefits from a crowd. Watching this alone on my laptop is about the saddest movie watching experience and nothing at all was funny or interesting to me. I've watched some bad movies but this one is rough. 11. Objectively best film of all time I keep coming back to this since there's a bunch of movies that would be the right answer. In the end I think The Prestige (2006) is my answer because I remember watching it the first time and thinking how great it was. The second time I watched it, it was even better because now I was trying to catch the reveals from the first viewing. And Bowie as Tesla. 12. Film you could watch again and again My wife and I have different movie tastes but we usually try to watch The Fifth Element (1997) and Rogue One (2016) at least once a year. I think its impossible to get tired of watching The Fifth Element. Fun SciFi movie with a great cast and music and the attention to detail in the world built for it always has me feeling like I'm seeing new things for the first time. 13. Film to be buried with The Brothers Bloom (2008) could easily answer most of the other questions from above but I felt like this would be best for the end. It has a wonderful cast, magic, crime, a sibling relationship, mystery, romance, comedy, friendship. I'm sure there are many flaws with it but the good things in this movie are really good to me and I would hope sharing it through this medium might help others see it much the same way. -- That's my list. I've had this in multiple states of drafted since I talked about this over a year ago at a Homebrew Website Club meeting and I'm happy I've finally finished it.",
			"date_published": "2023-07-04T00:00:00.000Z",
			"tags": [
				"movies"
			]
		},
		{
			"id": "https://benji.dog/notes/1687413483/",
			"url": "https://benji.dog/notes/1687413483/",
			"content_text": "16 years. Thats how long it took to get here.",
			"date_published": "2023-06-22T05:58:02.972+00:00"
		},
		{
			"id": "https://benji.dog/notes/1683263008/",
			"url": "https://benji.dog/notes/1683263008/",
			"content_text": "A few months ago I picked this up from a Little Free Library in the neighborhood. Today my kid picked it to read for bedtime. Happy May 4th.",
			"date_published": "2023-05-04T23:03:28.130+00:00",
			"tags": [
				"O"
			]
		},
		{
			"id": "https://benji.dog/notes/1682225824/",
			"url": "https://benji.dog/notes/1682225824/",
			"title": "Reply to https://jamesg.blog/2023/04/18/source-code-folder-names/",
			"content_text": "I've seen some people use either ~/code, ~/projects, or ~/programming. The first IDE I used was Eclipse and by default it would create projects under ~/workspace. Since then I've been using that as my source code directory but also because its a small reference to Hackers (1995).",
			"date_published": "2023-04-23T04:57:03.588+00:00"
		},
		{
			"id": "https://benji.dog/notes/1681849790/",
			"url": "https://benji.dog/notes/1681849790/",
			"content_text": "Things have been quiet over here but I did recently make some changes to my watched page. You can click on a star rating to view the list of movies that fall into that rating (for example: ★★★). Now that I have most of the features to track my movie watches on here I might try to get access to the Letterboxd API so that I can POSSE to there.",
			"date_published": "2023-04-18T20:29:50.435+00:00"
		},
		{
			"id": "https://benji.dog/notes/1681757723/",
			"url": "https://benji.dog/notes/1681757723/",
			"title": "Reply to https://jamesg.blog/2023/04/14/tea-routines-uk/",
			"content_text": "Back home in Ecuador I don't remember anyone drinking tea unless it was for medicinal purposes (stomach ache, nausea, cold). We do coffee multiple times a day, and I still usually drink a cup of coffee right before bed. Tea culture in the UK was always fascinating to me so a few years ago I spent some time trying to learn how to make a proper cup of tea. I'm not sure if I got there but I sometimes will have my version of that as a treat.",
			"date_published": "2023-04-17T18:55:23.214+00:00"
		},
		{
			"id": "https://benji.dog/notes/1678338347/",
			"url": "https://benji.dog/notes/1678338347/",
			"content_text": "Funny issue with sparkles while trying to search for the movie Living. Only getting the top 10 results from OMDb so its finally time to add pagination",
			"date_published": "2023-03-09T05:05:47.296+00:00",
			"tags": [
				"sparkles"
			]
		},
		{
			"id": "https://benji.dog/articles/how-i-rate-movies/",
			"url": "https://benji.dog/articles/how-i-rate-movies/",
			"title": "How I Rate Movies",
			"content_text": "I've had this post drafted for a bit and after reading Robb Knight's post about their movie rating system, I thought it's about time I finish and post it. I like watching movies and I try to watch a lot of movies. For the past few years I've been using Letterboxd to track movies I watch. I didn't rate for a long time because I thought it was pointless and the rating only really applies to me but then quite a few times I found myself rewatching a movie that I had already watched because I didn't remember what I thought about it or completely forgot that I watched it. The main motivation for me building a micropub client was so that I could track my movie watch history on my site and move away from Letterboxd. I used to take a few days to log a movie on Letterboxd mostly out of forgetfulness but having my own client that I need to test makes me log movies sooner. This rating system was created so that I could remind myself generally what I thought about the movie without having to write a review and more importantly, make it easy to know whether I thought something was worth coming back to later. It doesn't always make sense but it works for me. Here's roughly how I rate movies: ★★★ is the baseline score. This is where all movies start. Every time I wish I was doing anything else, the movie drops ½. ★★★½ if I think the movie is worth a rewatch. ★★★★ is a great movie but I probably won't be coming back to it. ★★★★½ is great AND rewatchable. ★★★★★ is a perfect movie or it means something to me. Rating something under ★★★ is rare and it doesn't speak to the quality of the film as much of whether or not it was able to interest me. Fun data: 908 movies rated (Last updated 2023-02-15) rating count ½ 1 ★ 5 ★½ 8 ★★ 24 ★★½ 46 ★★★ 163 ★★★½ 179 ★★★★ 250 ★★★★½ 129 ★★★★★ 103",
			"date_published": "2023-02-15T15:00:00.000+00:00",
			"tags": [
				"movies"
			]
		},
		{
			"id": "https://benji.dog/notes/1676435700/",
			"url": "https://benji.dog/notes/1676435700/",
			"content_text": "always test in production",
			"date_published": "2023-02-15T04:34:59.786+00:00"
		},
		{
			"id": "https://benji.dog/notes/1676235003/",
			"url": "https://benji.dog/notes/1676235003/",
			"content_text": "Even though webmention.app is down, you can still use the latest production release as seen in the original repo: github.com/remy/wm",
			"date_published": "2023-02-12T20:50:02.709+00:00"
		},
		{
			"id": "https://benji.dog/notes/1675107932/",
			"url": "https://benji.dog/notes/1675107932/",
			"title": "Reply to https://mxb.dev/blog/seven-reasons-why-i-dont-write/",
			"content_text": "&quot;I dont have anything interesting to say&quot; is the one that resonates with me the most. I'm trying to think of my site as more of a public journal where the content is for me first and if someone gets something out of it, thats just a bonus. I still dont write much because &quot;I gotta fix [x] on my site first&quot;",
			"date_published": "2023-01-30T19:45:31.595+00:00"
		},
		{
			"id": "https://benji.dog/notes/1674888021/",
			"url": "https://benji.dog/notes/1674888021/",
			"content_text": "New stuff for sparkles! Books are added and cleaned up some code in movies.",
			"date_published": "2023-01-28T06:40:20.960+00:00",
			"tags": [
				"sparkles"
			]
		},
		{
			"id": "https://benji.dog/notes/1674746249/",
			"url": "https://benji.dog/notes/1674746249/",
			"content_text": "I have some new changes for sparkles but I'm struggling with the format for movie and book logs. h-review works but if you're not adding a rating or review then it should be an h-entry with a u-watch-of. But maybe all logs should be an h-entry and if theres a review it should also post an h-review. Another issue for me with h-review is that it will need a tag (or category) to mark it as a movie, book, or anything else.",
			"date_published": "2023-01-26T15:17:28.563+00:00",
			"tags": [
				"🦆"
			]
		},
		{
			"id": "https://benji.dog/notes/1673553948/",
			"url": "https://benji.dog/notes/1673553948/",
			"content_text": "Feeling better about my /watched feed which lists everything as h-review. Posts will still show up chronologically in the all feed as a regular h-entry.",
			"date_published": "2023-01-12T20:05:47.683+00:00",
			"tags": [
				"this", "indieweb", "microformats"
			]
		},
		{
			"id": "https://benji.dog/articles/2022/",
			"url": "https://benji.dog/articles/2022/",
			"title": "2022",
			"content_text": "_______ _______ _______ _______ | || _ || || | |____ || | | ||____ ||____ | ____| || | | | ____| | ____| | | ______|| |_| || ______|| ______| | |_____ | || |_____ | |_____ |_______||_______||_______||_______| I haven't done one of these before and also don't think I have the discipline to do these often. Still, I thought it would be fun to try and recap what happened and what I did in 2022. Personal A (wife), O (kid), and I have been in our house for 2 years now. This year also marks our house's 100th year from when it was built which is ridiculous to even think about. There's a lot of cool info I was able to find in public library records about the house including some pictures of it from a long time ago. We've had friends and family visit us this past year which has been nice as travelling with a toddler by plane still feels very scary to me. We have a list of places where we think would be a good place to travel with O but haven't settled on anything yet. Code I took on a few more responsibilities at work including the backend of some of the applications I work with. I hadn't looked at Java code in a bit but it felt quite natural coming back to it after all these years. Outside of work duties I have been working a little more on some personal projects. The big thing I worked on this year was a micropub client called sparkles. This was a project I had started, trashed, and restarted a few times but was committed to getting it to some state of completeness this year. I also did some minor changes to my micropub endpoint. I keep debating naming this something but haven't quite decided what to do there. One last project that I started working on was an indieauth and token endpoint to switch away from indieauth.com. I keep hearing about plans to possibly deprecate IndieAuth and this also seems like the next logical step of IndieWeb related projects for me to work on. Movies I miss going to the movies but I'm still very cautious with indoor spaces where others are unmasked. I only saw three movies in theaters this year but hoping that changes in 2023. This year I watched 138 movies (100 new and 38 rewatched). That's 5 less movies than 2021 but 22 more new movies watched. Favorites: Everything Everywhere All at Once (2022) Aftersun (2022) TV I don't add episodes watched here but I do actively track everything I've watched on trakt. The Office is somehow always on TV so whenever A and I don't have anything to watch and O is asleep, that goes on. There's also a lot of Bluey. A few favorites from this year: Andor The Bear Our Flag Means Death Reservation Dogs The Resort Rewatched Halt and Catch Fire Station Eleven Ted Lasso Music I moved from Spotify to Apple Music earlier this year. One of the biggest things that I've missed is access to Spotify's Discover Weekly which makes finding music from new artists harder now. Apple's alternative has not figured me out yet or is just not even close to Spotify's. Favorite new releases: Skinny Ape - Gorillaz Contraluz - Joliette Time Skiffs - Animal Collective Wet Leg - Wet Leg Pool Kids - Pool Kids And In The Darkness, Hearts Aglow - Weyes Blood I've also been enjoying figuring out what sort of stuff O likes to listen to. Whenever he reacts to music we save it and replay it later and if he reacts positvely multiple times, we add it to his playlist: Music of Oz We haven't added anything new in a bit because he's currently in a Gorillaz only phase. I'm not complaining. Read I also haven't figured out how I want these posted on my site but I went back through what I've read and thought I'd add them here for now. Star Wars: The Rising Storm by Cavan Scott Star Wars: The High Republic The Fallen Star by Claudia Gray Dark Disciple: Star Wars by Christie Golden My Own Devices: Essays From the Road on Music, Science, and Senseless Love by Dessa Colorless Tsukuru Tazaki and His Years of Pilgrimage by Haruki Murakami How to Do Nothing: Resisting the Attention Economy by Jenny Odell The Kaiju Preservation Society by John Scalzi Down and Out in the Magic Kingdom by Cory Doctorow Kafka on the Shore by Haruki Murakami The Master and Margarita by Mikhail Bulgakov Bolero by Wyatt Kennedy and Luana Vecchio Ducks: Two Years in the Oil Sands by Kate Beaton The Many Deaths of Laila Starr by Ram V. and Filipe Andrade Monkey Meat by Juni Ba Saga, Volume 10 by Brian K. Vaughan and Fiona Staples Games Pokemon Legends: Arceus Lego Star Wars: The Skywalker Saga OlliOlli World Cyberpunk 2077 Stray Cult of the Lamb Tunic Pokemon Violet",
			"date_published": "2022-12-31T00:00:00.000Z",
			"tags": [
				"year in review"
			]
		},
		{
			"id": "https://benji.dog/notes/1672082670/",
			"url": "https://benji.dog/notes/1672082670/",
			"content_text": "made a whole batch of alfajores for my kid's birthday and only got to eat one",
			"date_published": "2022-12-26T19:24:30.295+00:00"
		},
		{
			"id": "https://benji.dog/notes/1671760313/",
			"url": "https://benji.dog/notes/1671760313/",
			"content_text": "Today was my first day off and somehow I feel more tired than if I worked all day",
			"date_published": "2022-12-23T01:51:52.613+00:00"
		},
		{
			"id": "https://benji.dog/notes/1671564010/",
			"url": "https://benji.dog/notes/1671564010/",
			"content_text": "2023 may actually be the year I switch to neovim",
			"date_published": "2022-12-20T19:20:10.383+00:00"
		},
		{
			"id": "https://benji.dog/articles/colors/",
			"url": "https://benji.dog/articles/colors/",
			"title": "colors",
			"content_text": "It's not super obvious from this website but I like colors. I'm not comfortable working until I have a proper colorscheme that works in all the editors I use. For a little while now I've been working on Sylveon and use that as my main colorscheme everywhere. I still wanted a place to collect colorschemes but there are so many beautiful colorschemes out there so I just wanted to list a few that I like and have used sorted by when I learned about them. Dracula Challenger Deep Fairyfloss Witch Hazel Panda Rosé Pine Catppuccin SAGATheme SweetPastel dogrun I obviously like pastel colors and dark themes. I'll update this as I find more colorschemes I like. Also worth checking out compute cuter.",
			"date_published": "2022-12-05T00:00:00.000Z",
			"tags": [
				"colors"
			]
		}
	]
}