[
  {
    "type": "entry",
    "author": {
      "type": "card",
      "name": "Andrés Cárdenas",
      "photo": "https://webmention.io/avatar/kandr3s.co/773ba94cd9bcf89e7d46c7a20a2fd6399af41857ecffc5883e9720ecea50bd2d.jpg",
      "url": "https://kandr3s.co"
    },
    "url": "https://kandr3s.co/post/indieweb-is-the-way",
    "published": "2021-12-02T17:33:13+01:00",
    "wm-received": "2021-12-02T17:18:54Z",
    "wm-id": 1311812,
    "wm-source": "https://kandr3s.co/post/indieweb-is-the-way",
    "wm-target": "https://www.benji.dog/",
    "name": "IndieWeb is the way",
    "syndication": [
      "https://twitter.com/kandr3s/status/1466478899567771655"
    ],
    "content": {
      "html": "<p>Two months ago I started implementing IndieWeb principles on my website. I use <em>started</em> because it has been a long process of tinkering with different tools and learning to use technologies I never expected to be using.</p>\n<p>Naturally, the progress has been slow as I’m often running into problems beyond my skillset. However, by reaching out to <a href=\"https://jamesvandyne.com/\">other</a> <a href=\"https://www.benji.dog/\">community</a> <a href=\"https://jamesg.blog/\">members</a> I’ve been able to slowly setup things kind of the way I want. Because it’s true that on the IndieWeb everyone assumes you’re a developer, but most people are nice enough to open source their code and even go the extra mile helping with one’s particular use cases.</p>\n<p>This website’s original goal was for me to have an online presence that was fully controlled by me, but thanks to the IndieWeb it’s turning into my single Internet channel. And how can it not progress in that direction when there’s <a href=\"https://robbinespu.gitlab.io/\">many</a> <a href=\"https://martymcgui.re/\">inspiring</a> <a href=\"https://retro.jamesg.blog/\">websites</a> on the <a href=\"https://xn--sr8hvo.ws/directory\"><em>IndieWebring</em></a> alone?</p>\n<p>What started as moving my content back to Jekyll from Tumblr, resulted in personal website that implemented microformats, used a Heroku-hosted micropub endpoint and relied on Quill to post updates. Right now everything I need to post or read online is hosted on my personal domain.</p>\n<p>I’m using a slightly modified version of this <a href=\"https://github.com/benjifs/micropub\">micropub endpoint</a> hosted on Netlify and I’m customizing a <a href=\"https://github.com/muan/micropub-client\">micropub client</a>, it’s fully functional at the moment, but I’m still trying to figure out how to get it to store sessions longer (or indefinitely), it deletes them automatically after x time. Self-hosting a social reader like <strong>Together</strong> or Monocle sounds like the next reasonable step but I love <strong><a href=\"https://github.com/nkanaev/yarr\">yarr!</a></strong> too much to give up on it, so I finally put everything on a subdomain and this is how I’m posting and reading on the Internet these days:</p>\n\n<a href=\"/m/1e225176bb8ce8e2c0efc1ec0fb77894dca9ea484e8fb5acab2a5596df1443a9.webp\">\n<img src=\"/m/1e225176bb8ce8e2c0efc1ec0fb77894dca9ea484e8fb5acab2a5596df1443a9.webp\" alt=\"Custom micropub client\" style=\"margin-top:10px;max-height:340px;\" /></a>\n\n    <a href=\"/m/4e857813c614ec3202b4b9be1d6a2674fb38027288a677feacf896a1fdd752f8.webp\">\n    <img src=\"/m/4e857813c614ec3202b4b9be1d6a2674fb38027288a677feacf896a1fdd752f8.webp\" alt=\"yarr! an RSS feeds reader\" /></a>\n    <a href=\"/m/7aad0ca324ff0a82c2ec5799a39fd0f5b6f71fcb283dfcf60beea42c170f9aff.jpg\">\n    <img src=\"/m/7aad0ca324ff0a82c2ec5799a39fd0f5b6f71fcb283dfcf60beea42c170f9aff.jpg\" style=\"margin-top:5px;\" alt=\"7aad0ca324ff0a82c2ec5799a39fd0f5b6f71fcb283dfcf60beea42c170f9aff.jpg\" /></a>\n\n\n<p>I know there’s a lot to improve in this setup, and who knows, maybe some day, I can build implementations of IndieAuth, Webmentions, etc… or build something as cool as <a href=\"https://jamesvandyne.com/2c31e96a-fae8-48da-beb3-b5324019c4eb\">Tanzawa</a> or <a href=\"https://hacdias.com/2021/11/19/farewell-hugo-hello-eagle\">Eagle</a>, but as of right now, this is something I’m kind of proud of and felt like that was worth sharing here.</p>",
      "text": "Two months ago I started implementing IndieWeb principles on my website. I use started because it has been a long process of tinkering with different tools and learning to use technologies I never expected to be using.\nNaturally, the progress has been slow as I’m often running into problems beyond my skillset. However, by reaching out to other community members I’ve been able to slowly setup things kind of the way I want. Because it’s true that on the IndieWeb everyone assumes you’re a developer, but most people are nice enough to open source their code and even go the extra mile helping with one’s particular use cases.\nThis website’s original goal was for me to have an online presence that was fully controlled by me, but thanks to the IndieWeb it’s turning into my single Internet channel. And how can it not progress in that direction when there’s many inspiring websites on the IndieWebring alone?\nWhat started as moving my content back to Jekyll from Tumblr, resulted in personal website that implemented microformats, used a Heroku-hosted micropub endpoint and relied on Quill to post updates. Right now everything I need to post or read online is hosted on my personal domain.\nI’m using a slightly modified version of this micropub endpoint hosted on Netlify and I’m customizing a micropub client, it’s fully functional at the moment, but I’m still trying to figure out how to get it to store sessions longer (or indefinitely), it deletes them automatically after x time. Self-hosting a social reader like Together or Monocle sounds like the next reasonable step but I love yarr! too much to give up on it, so I finally put everything on a subdomain and this is how I’m posting and reading on the Internet these days:\n\n\n\n\n    \n    \n    \n    \n\n\nI know there’s a lot to improve in this setup, and who knows, maybe some day, I can build implementations of IndieAuth, Webmentions, etc… or build something as cool as Tanzawa or Eagle, but as of right now, this is something I’m kind of proud of and felt like that was worth sharing here."
    },
    "mention-of": "https://www.benji.dog/",
    "wm-property": "mention-of",
    "wm-private": false,
    "rels": {
      "canonical": "https://kandr3s.co/post/indieweb-is-the-way"
    }
  }
]