[
  {
    "date": "2025-03-06",
    "name": "Los Frikis",
    "published": "2024",
    "id": "tmdb:980296",
    "photo": "https://image.tmdb.org/t/p/original/kCGWNd8yFQ3E695kYuaUUv62pJP.jpg",
    "content": "Gustavo idolizes his older brother Paco and his punk, \"Frikis\" bandmates. When word reaches the Frikis of a potential reprieve from the effects of the economic crisis, they do the now unthinkable: deliberately inject themselves with HIV to live at a government-run treatment home. It's there that they create their own utopia to live and play music freely.",
    "url": "https://themoviedb.org/movie/980296"
  },
  {
    "date": "2022-12-27",
    "name": "Victoria",
    "published": "2015",
    "id": "tmdb:320007",
    "photo": "https://image.tmdb.org/t/p/original/9P8QgfoMcFX7vp2Gj2cYFecHVRZ.jpg",
    "content": "A young Spanish woman who has newly moved to Berlin finds her flirtation with a local guy turn potentially deadly as their night out with his friends reveals a dangerous secret.",
    "url": "https://themoviedb.org/movie/320007"
  },
  {
    "date": "2020-06-09",
    "name": "Phantom of the Paradise",
    "published": "1974",
    "id": "tmdb:27327",
    "photo": "https://image.tmdb.org/t/p/original/qDOtGWeSQNwB3dG7Amt1K0JW0az.jpg",
    "content": "Fledgling singer-songwriter Winslow Leach finds himself double-crossed by the nefarious music producer Swan, who steals both his music and the girl Winslow wants to sing it, Phoenix, for the grand opening of his new rock palace, the Paradise. After Swan has Winslow sent to prison for trespassing, Winslow endures a freak accident that leaves him disfigured and seeking revenge.",
    "url": "https://themoviedb.org/movie/27327"
  },
  {
    "date": "2020-01-08",
    "name": "Warcraft",
    "published": "2016",
    "id": "tmdb:68735",
    "photo": "https://image.tmdb.org/t/p/original/nZIIOs06YigBnvmlJ2hxZeA8eTO.jpg",
    "content": "The peaceful realm of Azeroth stands on the brink of war as its civilization faces a fearsome race of invaders: orc warriors fleeing their dying home to colonize another. As a portal opens to connect the two worlds, one army faces destruction and the other faces extinction. From opposing sides, two heroes are set on a collision course that will decide the fate of their family, their people, and their home.",
    "url": "https://themoviedb.org/movie/68735"
  },
  {
    "date": "2020-01-08",
    "name": "Prisoners",
    "published": "2013",
    "id": "tmdb:146233",
    "photo": "https://image.tmdb.org/t/p/original/uhviyknTT5cEQXbn6vWIqfM4vGm.jpg",
    "content": "Keller Dover is facing every parent’s worst nightmare. His six-year-old daughter, Anna, is missing, together with her young friend, Joy, and as minutes turn to hours, panic sets in. The only lead is a dilapidated RV that had earlier been parked on their street.",
    "url": "https://themoviedb.org/movie/146233"
  },
  {
    "date": "2020-01-08",
    "name": "Searching",
    "published": "2018",
    "id": "tmdb:489999",
    "photo": "https://image.tmdb.org/t/p/original/yuAPCsCGJGSxA7YOW4elF5JNrzK.jpg",
    "content": "After David Kim's 16-year-old daughter goes missing, a local investigation is opened and a detective is assigned to the case. But 37 hours later and without a single lead, David decides to search the one place no one has looked yet, where all secrets are kept today: his daughter's laptop.",
    "url": "https://themoviedb.org/movie/489999"
  },
  {
    "date": "2020-01-08",
    "name": "The Bridges of Madison County",
    "published": "1995",
    "id": "tmdb:688",
    "photo": "https://image.tmdb.org/t/p/original/8TfLAfIh5Qxp2J4ZjOafHYhWtDb.jpg",
    "content": "Photographer Robert Kincaid wanders into the life of housewife Francesca Johnson for four days in the 1960s.",
    "url": "https://themoviedb.org/movie/688"
  },
  {
    "date": "2020-01-08",
    "name": "L'Écume des jours",
    "published": "2013",
    "id": "tmdb:157820",
    "photo": "https://image.tmdb.org/t/p/original/y41mndWYov3oPSZdHUtyjEdALvF.jpg",
    "content": "A woman suffers from an unusual illness caused by a flower growing in her lungs.",
    "url": "https://themoviedb.org/movie/157820"
  },
  {
    "date": "2020-01-08",
    "name": "Kumiko, the Treasure Hunter",
    "published": "2014",
    "id": "tmdb:244563",
    "photo": "https://image.tmdb.org/t/p/original/fuYdg3ADcPRr3vJmjnF98ZDjnR7.jpg",
    "content": "Frustrated with her mundane life, a Tokyo office worker becomes obsessed with a fictional movie that she mistakes for a documentary. Fixating on a scene where stolen cash is buried in North Dakota, she travels to America to find it.",
    "url": "https://themoviedb.org/movie/244563"
  },
  {
    "date": "2020-01-08",
    "name": "Bone Tomahawk",
    "published": "2015",
    "id": "tmdb:294963",
    "photo": "https://image.tmdb.org/t/p/original/4MmTHpn2Y8emqvBgvOjufImUmKZ.jpg",
    "content": "During a shootout in a saloon, Sheriff Hunt injures a suspicious stranger. The doctor's assistant, wife of the local foreman, tends to him in prison. That night, the town is attacked and they both disappear—only the arrow of a cannibal tribe is found. Hunt and a few of his men go in search of the prisoner and the foreman's wife.",
    "url": "https://themoviedb.org/movie/294963"
  },
  {
    "date": "2020-01-08",
    "name": "Peter Rabbit",
    "published": "2018",
    "id": "tmdb:381719",
    "photo": "https://image.tmdb.org/t/p/original/cBWtdp8mgce4QQkH697LpaL0Iik.jpg",
    "content": "Peter Rabbit's feud with Mr. McGregor escalates to greater heights than ever before as they rival for the affections of the warm-hearted animal lover who lives next door.",
    "url": "https://themoviedb.org/movie/381719"
  },
  {
    "date": "2020-01-08",
    "name": "The Florida Project",
    "published": "2017",
    "id": "tmdb:394117",
    "photo": "https://image.tmdb.org/t/p/original/eE1J6nCMw8UhsAOI6HhhItarWmN.jpg",
    "content": "The story of a precocious six year-old and her ragtag group of friends whose summer break is filled with childhood wonder, possibility and a sense of adventure while the adults around them struggle with hard times.",
    "url": "https://themoviedb.org/movie/394117"
  },
  {
    "date": "2020-01-08",
    "name": "You Were Never Really Here",
    "published": "2017",
    "id": "tmdb:398181",
    "photo": "https://image.tmdb.org/t/p/original/nx4lUyQNEzJowcF55VAP0TQEaX0.jpg",
    "content": "A traumatised veteran, unafraid of violence, tracks down missing girls for a living. When a job spins out of control, his nightmares overtake him as a conspiracy is uncovered leading to what may be his death trip or his awakening.",
    "url": "https://themoviedb.org/movie/398181"
  },
  {
    "date": "2020-01-08",
    "name": "Beach Rats",
    "published": "2017",
    "id": "tmdb:426238",
    "photo": "https://image.tmdb.org/t/p/original/oQZPPsvoipd38jasPhvJOpajbug.jpg",
    "content": "On the outskirts of Brooklyn, Frankie, an aimless teenager, suffocates under the oppressive glare cast by his family and a toxic group of delinquent friends. Struggling with his own identity, Frankie begins to scour hookup sites for older men.",
    "url": "https://themoviedb.org/movie/426238"
  },
  {
    "date": "2020-01-08",
    "name": "Overlord",
    "published": "2018",
    "id": "tmdb:438799",
    "photo": "https://image.tmdb.org/t/p/original/l76Rgp32z2UxjULApxGXAPpYdAP.jpg",
    "content": "France, June 1944. On the eve of D-Day, some American paratroopers fall behind enemy lines after their aircraft crashes while on a mission to destroy a radio tower in a small village near the beaches of Normandy. After reaching their target, the surviving paratroopers realise that, in addition to fighting the Nazi troops that patrol the village, they also must fight against something else.",
    "url": "https://themoviedb.org/movie/438799"
  },
  {
    "date": "2020-01-08",
    "name": "Mamma Mia! Here We Go Again",
    "published": "2018",
    "id": "tmdb:458423",
    "photo": "https://image.tmdb.org/t/p/original/aWicerX4Y7n7tUwRAVHsVcBBpj2.jpg",
    "content": "Five years after meeting her three fathers, Sophie Sheridan prepares to open her mother’s hotel. In 1979, young Donna Sheridan meets the men who each could be Sophie’s biological father.",
    "url": "https://themoviedb.org/movie/458423"
  },
  {
    "date": "2020-01-08",
    "name": "T2 Trainspotting",
    "published": "2017",
    "id": "tmdb:180863",
    "photo": "https://image.tmdb.org/t/p/original/xlbpCwa9OXXIiNgXcwuompHFIk9.jpg",
    "content": "After 20 years abroad, Mark Renton returns to Scotland and reunites with his old friends Sick Boy, Spud and Begbie.",
    "url": "https://themoviedb.org/movie/180863"
  },
  {
    "date": "2020-01-08",
    "name": "Miss Peregrine's Home for Peculiar Children",
    "published": "2016",
    "id": "tmdb:283366",
    "photo": "https://image.tmdb.org/t/p/original/CIlbMFOfYDj0MP23hsIYhFGrL6.jpg",
    "content": "A teenager finds himself transported to an island where he must help protect a group of orphans with special powers from creatures intent on destroying them.",
    "url": "https://themoviedb.org/movie/283366"
  },
  {
    "date": "2020-01-08",
    "name": "Rules Don't Apply",
    "published": "2016",
    "id": "tmdb:291328",
    "photo": "https://image.tmdb.org/t/p/original/a7Gtn4CNsNYKVlkCBspfETd6z7r.jpg",
    "content": "It's Hollywood, 1958. Small town beauty queen and devout Baptist virgin Marla Mabrey, under contract to the infamous Howard Hughes, arrives in Los Angeles. At the airport, she meets her driver Frank Forbes, who is engaged to be married to his seventh grade sweetheart and is a deeply religious Methodist. Their instant attraction not only puts their religious convictions to the test, but also defies Hughes' number one rule: No employee is allowed to have any relationship whatsoever with a contract actress. Hughes' behavior intersects with Marla and Frank in very separate and unexpected ways, and as they are drawn deeper into his bizarre world, their values are challenged and their lives are changed.",
    "url": "https://themoviedb.org/movie/291328"
  },
  {
    "date": "2020-01-08",
    "name": "Manchester by the Sea",
    "published": "2016",
    "id": "tmdb:334541",
    "photo": "https://image.tmdb.org/t/p/original/o9VXYOuaJxCEKOxbA86xqtwmqYn.jpg",
    "content": "After his older brother passes away, Lee Chandler is forced to return home to care for his 16-year-old nephew. There he is compelled to deal with a tragic past that separated him from his family and the community where he was born and raised.",
    "url": "https://themoviedb.org/movie/334541"
  },
  {
    "date": "2020-01-08",
    "name": "The Belko Experiment",
    "published": "2016",
    "id": "tmdb:341006",
    "photo": "https://image.tmdb.org/t/p/original/faJK0dP3S92kQoKtO4LZMjy41kf.jpg",
    "content": "A group of eighty American workers are locked in their office and ordered by an unknown voice to participate in a twisted game.",
    "url": "https://themoviedb.org/movie/341006"
  },
  {
    "date": "2020-01-08",
    "name": "The Girl on the Train",
    "published": "2016",
    "id": "tmdb:346685",
    "photo": "https://image.tmdb.org/t/p/original/AhTO2QWG0tug7yDoh0XoaMhPt3J.jpg",
    "content": "Rachel Watson, devastated by her recent divorce, spends her daily commute fantasizing about the seemingly perfect couple who live in a house that her train passes every day, until one morning she sees something shocking happen there and becomes entangled in the mystery that unfolds.",
    "url": "https://themoviedb.org/movie/346685"
  },
  {
    "date": "2020-01-08",
    "name": "Tiger Girl",
    "published": "2017",
    "id": "tmdb:427023",
    "photo": "https://image.tmdb.org/t/p/original/iGnbgXQ39qtopRZDmBnYG9gR3lJ.jpg",
    "content": "Having failed to get into the police force, Margarete takes up training as a security guard. One night she runs into a sexually agressive ex-colleague who insists on hailing a taxi to take her home to his place. Enter Tiger: short brown hair, a tough girl and a fighter, the cab driver. Realising that the situation is far from consensual, Tiger speeds off with Margarete, leaving her companion standing in the street. It won’t be the last time she rushes to Margarete’s aid. Tiger lives in an attic flat with two men. She knows how to wield a baseball bat. Stealing a uniform from security and renaming Margarete ‘Vanilla’, she begins to steer her life in a completely different direction.",
    "url": "https://themoviedb.org/movie/427023"
  },
  {
    "date": "2020-01-08",
    "name": "The Boy in the Striped Pyjamas",
    "published": "2008",
    "id": "tmdb:14574",
    "photo": "https://image.tmdb.org/t/p/original/sLwYSEVVV3r047cjrpRAbGgNsfL.jpg",
    "content": "When his family moves from their home in Berlin to a strange new house in Poland, young Bruno befriends Shmuel, a boy who lives on the other side of the fence where everyone seems to be wearing striped pajamas. Unaware of Shmuel's fate as a Jewish prisoner or the role his own Nazi father plays in his imprisonment, Bruno embarks on a dangerous journey inside the camp's walls.",
    "url": "https://themoviedb.org/movie/14574"
  },
  {
    "date": "2020-01-08",
    "name": "Coco avant Chanel",
    "published": "2009",
    "id": "tmdb:11156",
    "photo": "https://image.tmdb.org/t/p/original/nNpP1P2EufA6TN7fQOBeHUIVmeH.jpg",
    "content": "Several years after leaving the orphanage, to which her father never returned for her, Gabrielle Chanel finds herself working in a provincial bar. She's both a seamstress for the performers and a singer, earning the nickname Coco from the song she sings nightly with her sister. A liaison with Baron Balsan gives her an entree into French society and a chance to develop her gift for designing.",
    "url": "https://themoviedb.org/movie/11156"
  },
  {
    "date": "2020-01-08",
    "name": "The Golden Compass",
    "published": "2007",
    "id": "tmdb:2268",
    "photo": "https://image.tmdb.org/t/p/original/6DTH9poR8RAw859L6OuokT7z993.jpg",
    "content": "After overhearing a shocking secret, precocious orphan Lyra Belacqua trades her carefree existence roaming the halls of Jordan College for an otherworldly adventure in the far North, unaware that it's part of her destiny.",
    "url": "https://themoviedb.org/movie/2268"
  },
  {
    "date": "2020-01-08",
    "name": "Letters from Iwo Jima",
    "published": "2006",
    "id": "tmdb:1251",
    "photo": "https://image.tmdb.org/t/p/original/kZokxQtzMPURvijWYFuvh1fAvnv.jpg",
    "content": "The story of the battle of Iwo Jima between the United States and Imperial Japan during World War II, as told from the perspective of the Japanese who fought it.",
    "url": "https://themoviedb.org/movie/1251"
  },
  {
    "date": "2020-01-08",
    "name": "Army of Darkness",
    "published": "1992",
    "id": "tmdb:766",
    "photo": "https://image.tmdb.org/t/p/original/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
    "content": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
    "url": "https://themoviedb.org/movie/766"
  },
  {
    "date": "2020-01-08",
    "name": "Song of the Sea",
    "published": "2014",
    "id": "tmdb:110416",
    "photo": "https://image.tmdb.org/t/p/original/16LQC6zpqB0l74mVWb93a2oMFnX.jpg",
    "content": "The story of the last Seal Child’s journey home. After their mother’s disappearance, Ben and Saoirse are sent to live with Granny in the city. When they resolve to return to their home by the sea, their journey becomes a race against time as they are drawn into a world Ben knows only from his mother’s folktales. But this is no bedtime story; these fairy folk have been in our world far too long. It soon becomes clear to Ben that Saoirse is the key to their survival.",
    "url": "https://themoviedb.org/movie/110416"
  },
  {
    "date": "2020-01-08",
    "name": "君の名は。",
    "published": "2016",
    "id": "tmdb:372058",
    "photo": "https://image.tmdb.org/t/p/original/q719jXXEzOoYaps6babgKnONONX.jpg",
    "content": "High schoolers Mitsuha and Taki are complete strangers living separate lives. But one night, they suddenly switch places. Mitsuha wakes up in Taki’s body, and he in hers. This bizarre occurrence continues to happen randomly, and the two must adjust their lives around each other.",
    "url": "https://themoviedb.org/movie/372058"
  },
  {
    "date": "2020-01-08",
    "name": "Córki dancingu",
    "published": "2015",
    "id": "tmdb:375742",
    "photo": "https://image.tmdb.org/t/p/original/mxdssWM8WyzBFq6pYwBHeTIJK1A.jpg",
    "content": "Two mermaid sisters, who end up performing at a nightclub, face cruel and bloody choices when one of them falls in love with a beautiful young man.",
    "url": "https://themoviedb.org/movie/375742"
  },
  {
    "date": "2020-01-08",
    "name": "Melancholia",
    "published": "2011",
    "id": "tmdb:62215",
    "photo": "https://image.tmdb.org/t/p/original/fMneszMiQuTKY8JUXrGGB5vwqJf.jpg",
    "content": "Justine and Michael are celebrating their marriage at a sumptuous party in the home of her sister Claire, and brother-in-law John. Despite Claire’s best efforts, the wedding is a fiasco, with family tensions mounting and relationships fraying. Meanwhile, a planet called Melancholia is heading directly towards Earth…",
    "url": "https://themoviedb.org/movie/62215"
  },
  {
    "date": "2020-01-08",
    "name": "아저씨",
    "published": "2010",
    "id": "tmdb:51608",
    "photo": "https://image.tmdb.org/t/p/original/ld19CFIo27t41JXSGZdaPMUGTxh.jpg",
    "content": "An ex-special agent is involved in a convoluted drug ring drama. He has to save a drug smuggler's innocent daughter from being the victim of her parents' fight.",
    "url": "https://themoviedb.org/movie/51608"
  },
  {
    "date": "2020-01-08",
    "name": "An Education",
    "published": "2009",
    "id": "tmdb:24684",
    "photo": "https://image.tmdb.org/t/p/original/29kSosB0jW2ThaJmX6ZY1UQ1pHA.jpg",
    "content": "Despite her sheltered upbringing, Jenny is a teen with a bright future; she's smart, pretty, and has aspirations of attending Oxford University. When David, a charming but much older suitor, motors into her life in a shiny automobile, Jenny gets a taste of adult life that she won't soon forget.",
    "url": "https://themoviedb.org/movie/24684"
  },
  {
    "date": "2020-01-08",
    "name": "Puccini for Beginners",
    "published": "2006",
    "id": "tmdb:20405",
    "photo": "https://image.tmdb.org/t/p/original/b5yBAYkXa6jSfBr0iayon8CkXC9.jpg",
    "content": "When her inability to commit leads to a breakup with her girlfriend, opera-loving writer Allegra winds up in the bed of amiable professor Philip. He is so smitten with Allegra that he dumps his lover, Grace, and convinces Allegra to continue their affair. When Allegra meets Grace, sparks fly, and she begins a parallel romance, unaware that her new lover is the woman Philip left to be with her.",
    "url": "https://themoviedb.org/movie/20405"
  },
  {
    "date": "2020-01-08",
    "name": "Very Good Girls",
    "published": "2013",
    "id": "tmdb:70706",
    "photo": "https://image.tmdb.org/t/p/original/4TmLzB5bEUUQbFqMgWQjkDC2mUN.jpg",
    "content": "Two New York City girls make a pact to lose their virginity during their first summer out of high school. When they both fall for the same street artist, the friends find their connection tested for the first time.",
    "url": "https://themoviedb.org/movie/70706"
  },
  {
    "date": "2020-01-08",
    "name": "Laurence Anyways",
    "published": "2012",
    "id": "tmdb:110160",
    "photo": "https://image.tmdb.org/t/p/original/chWSNDHcXOZ9bUzH0mkkAwcv3i1.jpg",
    "content": "The story of an impossible love between a woman named Fred and a transgender woman named Laurence who reveals her inner desire to become her true self.",
    "url": "https://themoviedb.org/movie/110160"
  },
  {
    "date": "2020-01-14",
    "name": "Apollo 11",
    "published": "2019",
    "id": "tmdb:549559",
    "photo": "https://image.tmdb.org/t/p/original/woLMRroHyoTGoXyxdEeBJEYBFtu.jpg",
    "content": "A look at the Apollo 11 mission to land on the moon led by commander Neil Armstrong and pilot Buzz Aldrin.",
    "url": "https://themoviedb.org/movie/549559"
  },
  {
    "date": "2016-04-07",
    "name": "Get on Up",
    "published": "2014",
    "id": "tmdb:239566",
    "photo": "https://image.tmdb.org/t/p/original/dVbGeU5agxFGcJnL5hk4uO8W7i2.jpg",
    "content": "A chronicle of James Brown's rise from extreme poverty to become one of the most influential musicians in history.",
    "url": "https://themoviedb.org/movie/239566"
  },
  {
    "date": "2016-01-09",
    "name": "Sicario",
    "published": "2015",
    "id": "tmdb:273481",
    "photo": "https://image.tmdb.org/t/p/original/lz8vNyXeidqqOdJW9ZjnDAMb5Vr.jpg",
    "content": "An idealistic FBI agent is enlisted by a government task force to aid in the escalating war against drugs at the border area between the U.S. and Mexico.",
    "url": "https://themoviedb.org/movie/273481"
  },
  {
    "date": "2016-01-09",
    "name": "Fruitvale Station",
    "published": "2013",
    "id": "tmdb:157354",
    "photo": "https://image.tmdb.org/t/p/original/oXSy3nEKFtfw5iRxdG8ouEFAnxs.jpg",
    "content": "Oakland, California. Young Afro-American Oscar Grant crosses paths with family members, friends, enemies and strangers before facing his fate on the platform at Fruitvale Station, in the early morning hours of New Year's Day 2009.",
    "url": "https://themoviedb.org/movie/157354"
  },
  {
    "date": "2016-01-11",
    "name": "Room",
    "published": "2015",
    "id": "tmdb:264644",
    "photo": "https://image.tmdb.org/t/p/original/pCURNjeomWbMSdiP64gj8NVVHTQ.jpg",
    "content": "Held captive for 7 years in an enclosed space, a woman and her young son finally gain their freedom, allowing the boy to experience the outside world for the first time.",
    "url": "https://themoviedb.org/movie/264644"
  },
  {
    "date": "2016-01-21",
    "name": "Carol",
    "published": "2015",
    "id": "tmdb:258480",
    "photo": "https://image.tmdb.org/t/p/original/cJeled7EyPdur6TnCA5GYg0UVna.jpg",
    "content": "In 1950s New York, a department-store clerk who dreams of a better life falls for an older, married woman.",
    "url": "https://themoviedb.org/movie/258480"
  },
  {
    "date": "2015-04-11",
    "name": "Match Point",
    "published": "2005",
    "id": "tmdb:116",
    "photo": "https://image.tmdb.org/t/p/original/vHjEVTD8ucuwKSFOZJeyAnTZYli.jpg",
    "content": "Chris, a former tennis player, looks for work as an instructor. He meets Tom Hewett, a wealthy young man whose sister Chloe falls in love with Chris. But Chris has his eye on Tom's fiancee Nola.",
    "url": "https://themoviedb.org/movie/116"
  },
  {
    "date": "2015-04-21",
    "name": "The Toxic Avenger",
    "published": "1984",
    "id": "tmdb:15239",
    "photo": "https://image.tmdb.org/t/p/original/so0CGT1fZe2SlVdYXCewghxUgoj.jpg",
    "content": "A gang of thugs devise a cruel hoax that goes horribly wrong as Melvin, a nerdy emaciated janitor at the local health club, is cast through a third story window into a vat of hazardous toxic waste.",
    "url": "https://themoviedb.org/movie/15239"
  },
  {
    "date": "2015-01-14",
    "name": "Cake",
    "published": "2014",
    "id": "tmdb:284276",
    "photo": "https://image.tmdb.org/t/p/original/5GJEZovjtKisJxNMG6fBTCxNzZi.jpg",
    "content": "After having visions of a member of her support group who killed herself, a woman who also suffers with chronic pain seeks out the widower of the suicide.",
    "url": "https://themoviedb.org/movie/284276"
  },
  {
    "date": "2015-01-19",
    "name": "Selma",
    "published": "2014",
    "id": "tmdb:273895",
    "photo": "https://image.tmdb.org/t/p/original/wq4lhMc4BuOyQqe1ZGzhxLyy3Uk.jpg",
    "content": "\"Selma,\" as in Alabama, the place where segregation in the South was at its worst, leading to a march that ended in violence, forcing a famous statement by President Lyndon B. Johnson that ultimately led to the signing of the Voting Rights Act.",
    "url": "https://themoviedb.org/movie/273895"
  },
  {
    "date": "2015-01-19",
    "name": "The Gambler",
    "published": "2014",
    "id": "tmdb:284536",
    "photo": "https://image.tmdb.org/t/p/original/hIgU3cxn7Y87joQGM3srofnXOm5.jpg",
    "content": "Literature professor Jim Bennett leads a secret life as a high-stakes gambler. Always a risk-taker, Bennett bets it all when he borrows from a gangster and offers his own life as collateral. Staying one step ahead, he pits his creditor against the operator of an illicit gambling ring while garnering the attention of Frank, a paternalistic loan shark. As his relationship with a student deepens, Bennett must risk everything for a second chance.",
    "url": "https://themoviedb.org/movie/284536"
  },
  {
    "date": "2015-01-19",
    "name": "No Country for Old Men",
    "published": "2007",
    "id": "tmdb:6977",
    "photo": "https://image.tmdb.org/t/p/original/bj1v6YKF8yHqA489VFfnQvOJpnc.jpg",
    "content": "Llewelyn Moss stumbles upon dead bodies, $2 million and a hoard of heroin in a Texas desert, but methodical killer Anton Chigurh comes looking for it, with local sheriff Ed Tom Bell hot on his trail. The roles of prey and predator blur as the violent pursuit of money and justice collide.",
    "url": "https://themoviedb.org/movie/6977"
  },
  {
    "date": "2015-01-19",
    "name": "Apocalypse Now",
    "published": "1979",
    "id": "tmdb:28",
    "photo": "https://image.tmdb.org/t/p/original/gQB8Y5RCMkv2zwzFHbUJX3kAhvA.jpg",
    "content": "At the height of the Vietnam war, Captain Benjamin Willard is sent on a dangerous mission that, officially, \"does not exist, nor will it ever exist.\" His goal is to locate - and eliminate - a mysterious Green Beret Colonel named Walter Kurtz, who has been leading his personal army on illegal guerrilla missions into enemy territory.",
    "url": "https://themoviedb.org/movie/28"
  },
  {
    "date": "2015-01-19",
    "name": "Brick",
    "published": "2006",
    "id": "tmdb:9270",
    "photo": "https://image.tmdb.org/t/p/original/5WVk8JpNIxepn4fpZzQeCumkOL5.jpg",
    "content": "After a phone call from his ex-girlfriend, teenage loner Brendan Frye learns that her dead body was found. Vowing to solve her murder himself, he must infiltrate high-school cliques that he previously avoided. His search for the truth brings him before some of the school’s roughest characters.",
    "url": "https://themoviedb.org/movie/9270"
  },
  {
    "date": "2015-01-19",
    "name": "Amour",
    "published": "2012",
    "id": "tmdb:86837",
    "photo": "https://image.tmdb.org/t/p/original/19hyCudualHxCD0GrEngqsi0wBF.jpg",
    "content": "Georges and Anne are in their eighties. They are cultivated, retired music teachers. Their daughter, who is also a musician, lives abroad with her family. One day, Anne has a stroke, and the couple's bond of love is severely tested.",
    "url": "https://themoviedb.org/movie/86837"
  },
  {
    "date": "2015-01-19",
    "name": "Babel",
    "published": "2006",
    "id": "tmdb:1164",
    "photo": "https://image.tmdb.org/t/p/original/cDy5iZL2C01jiT5wDSE4jOvoT52.jpg",
    "content": "In Babel, a tragic incident involving an American couple in Morocco sparks a chain of events for four families in different countries throughout the world.",
    "url": "https://themoviedb.org/movie/1164"
  },
  {
    "date": "2015-01-19",
    "name": "Eraserhead",
    "published": "1977",
    "id": "tmdb:985",
    "photo": "https://image.tmdb.org/t/p/original/mxveW3mGVc0DzLdOmtkZsgd7c3B.jpg",
    "content": "First-time father Henry Spencer tries to survive his industrial environment, his angry girlfriend, and the unbearable screams of his newly born mutant child.",
    "url": "https://themoviedb.org/movie/985"
  },
  {
    "date": "2015-01-19",
    "name": "Deux jours, une nuit",
    "published": "2014",
    "id": "tmdb:221902",
    "photo": "https://image.tmdb.org/t/p/original/na05HMiEEftqzBFnBOtqAgAr7zz.jpg",
    "content": "Sandra is a young woman who has only one weekend to convince her colleagues they must give up their bonuses in order for her to keep her job — not an easy task in this economy.",
    "url": "https://themoviedb.org/movie/221902"
  },
  {
    "date": "2015-01-28",
    "name": "Fury",
    "published": "2014",
    "id": "tmdb:228150",
    "photo": "https://image.tmdb.org/t/p/original/pfte7wdMobMF4CVHuOxyu6oqeeA.jpg",
    "content": "In the last months of World War II, as the Allies make their final push in the European theatre, a battle-hardened U.S. Army sergeant named 'Wardaddy' commands a Sherman tank called 'Fury' and its five-man crew on a deadly mission behind enemy lines. Outnumbered and outgunned, Wardaddy and his men face overwhelming odds in their heroic attempts to strike at the heart of Nazi Germany.",
    "url": "https://themoviedb.org/movie/228150"
  },
  {
    "date": "2015-01-28",
    "name": "My Old Lady",
    "published": "2014",
    "id": "tmdb:282296",
    "photo": "https://image.tmdb.org/t/p/original/hPLAUrmJkXdv1sEtIqk9EwXvmbH.jpg",
    "content": "Mathias Gold is a down-on-his-luck New Yorker who inherits a Parisian apartment from his estranged father. But when he arrives in France to sell the vast domicile, he's shocked to discover a live-in tenant who is not prepared to budge. His apartment is a viager—an ancient French real estate system with complex rules pertaining to its resale—and the feisty Englishwoman Mathilde Girard, who has lived in the apartment with her daughter Chloé for many years, can by contract collect monthly payments from Mathias until her death.",
    "url": "https://themoviedb.org/movie/282296"
  },
  {
    "date": "2015-01-28",
    "name": "Honeymoon",
    "published": "2014",
    "id": "tmdb:254191",
    "photo": "https://image.tmdb.org/t/p/original/n7n7sRffr6UloXNlprZTVLSV3Eo.jpg",
    "content": "Young newlyweds Paul and Bea travel to a remote lake cottage for their honeymoon, where the promise of private romance awaits them. Shortly after arriving, Paul finds Bea wandering and disoriented in the middle of the night.",
    "url": "https://themoviedb.org/movie/254191"
  },
  {
    "date": "2014-08-12",
    "name": "American Hustle",
    "published": "2013",
    "id": "tmdb:168672",
    "photo": "https://image.tmdb.org/t/p/original/koXGRfatN0tURFWMA0Keb0p0Gtg.jpg",
    "content": "A conman and his seductive partner are forced to work for a wild FBI agent, who pushes them into a world of Jersey power-brokers and the Mafia.",
    "url": "https://themoviedb.org/movie/168672"
  },
  {
    "date": "2014-08-12",
    "name": "Last Vegas",
    "published": "2013",
    "id": "tmdb:137093",
    "photo": "https://image.tmdb.org/t/p/original/9Aht200Eu2jYiE9cEQdFfNDtHl6.jpg",
    "content": "Aging pals Billy, Paddy, Archie, and Sam have been best friends since childhood. When Billy finally proposes to his much-younger girlfriend, all four friends go to Las Vegas to celebrate the end of Billy's longtime bachelorhood and relive their glory days. However, the four quickly realize that the intervening decades have changed Sin City and tested their friendship in ways they had not imagined.",
    "url": "https://themoviedb.org/movie/137093"
  },
  {
    "date": "2014-08-12",
    "name": "Nebraska",
    "published": "2013",
    "id": "tmdb:129670",
    "photo": "https://image.tmdb.org/t/p/original/o1t2Mw18EEBnl8v4Nby3PFjxnM1.jpg",
    "content": "An aging, booze-addled father takes a trip from Montana to Nebraska with his estranged son in order to claim what he believes to be a million-dollar sweepstakes prize.",
    "url": "https://themoviedb.org/movie/129670"
  },
  {
    "date": "2014-08-12",
    "name": "Jagten",
    "published": "2012",
    "id": "tmdb:103663",
    "photo": "https://image.tmdb.org/t/p/original/jkixsXzRh28q3PCqFoWcf7unghT.jpg",
    "content": "A teacher lives a lonely life, all the while struggling over his son’s custody. His life slowly gets better as he finds love and receives good news from his son, but his new luck is about to be brutally shattered by an innocent little lie.",
    "url": "https://themoviedb.org/movie/103663"
  },
  {
    "date": "2014-08-12",
    "name": "Charlie Wilson's War",
    "published": "2007",
    "id": "tmdb:6538",
    "photo": "https://image.tmdb.org/t/p/original/45FghqcdSYRWK7PsHUInaFPNd8l.jpg",
    "content": "In the 1980s U.S. Rep. Charlie Wilson, Texas socialite Joanne Herring and CIA agent Gust Avrakotos form an unlikely alliance to boost funding for Afghan freedom fighters in their war against invading Soviets. The trio's successful efforts to finance these covert operations contributes to the fall of the Soviet Union and the end of the Cold War.",
    "url": "https://themoviedb.org/movie/6538"
  },
  {
    "date": "2014-08-12",
    "name": "The Monuments Men",
    "published": "2014",
    "id": "tmdb:152760",
    "photo": "https://image.tmdb.org/t/p/original/wiWAg4mKV2S4vImPxsPRIdj2R2B.jpg",
    "content": "Based on the true story of the greatest treasure hunt in history, The Monuments Men is an action drama focusing on seven over-the-hill, out-of-shape museum directors, artists, architects, curators, and art historians who went to the front lines of WWII to rescue the world’s artistic masterpieces from Nazi thieves and return them to their rightful owners.  With the art hidden behind enemy lines, how could these guys hope to succeed?",
    "url": "https://themoviedb.org/movie/152760"
  },
  {
    "date": "2014-08-12",
    "name": "Under the Skin",
    "published": "2014",
    "id": "tmdb:97370",
    "photo": "https://image.tmdb.org/t/p/original/55wmcXJIDYITr7JDijJTdvwSaAv.jpg",
    "content": "A seductive stranger prowls the streets of Glasgow in search of prey: unsuspecting men who fall under her spell.",
    "url": "https://themoviedb.org/movie/97370"
  },
  {
    "date": "2014-08-12",
    "name": "Vertigo",
    "published": "1958",
    "id": "tmdb:426",
    "photo": "https://image.tmdb.org/t/p/original/15uOEfqBNTVtDUT7hGBVCka0rZz.jpg",
    "content": "A retired San Francisco detective suffering from acrophobia investigates the strange activities of an old friend's wife, all the while becoming dangerously obsessed with her.",
    "url": "https://themoviedb.org/movie/426"
  },
  {
    "date": "2014-08-12",
    "name": "Det sjunde inseglet",
    "published": "1957",
    "id": "tmdb:490",
    "photo": "https://image.tmdb.org/t/p/original/j6z3c6dGXtPHUATJX8J7Y70mM1S.jpg",
    "content": "When disillusioned Swedish knight Antonius Block returns home from the Crusades to find his country in the grips of the Black Death, he challenges Death to a chess match for his life. Tormented by the belief that God does not exist, Block sets off on a journey, meeting up with traveling players Jof and his wife, Mia, and becoming determined to evade Death long enough to commit one redemptive act while he still lives.",
    "url": "https://themoviedb.org/movie/490"
  },
  {
    "date": "2014-08-12",
    "name": "North by Northwest",
    "published": "1959",
    "id": "tmdb:213",
    "photo": "https://image.tmdb.org/t/p/original/kNOFPQrel9YFCVzI0DF8FnCEpCw.jpg",
    "content": "Advertising man Roger Thornhill is mistaken for a spy, triggering a deadly cross-country chase.",
    "url": "https://themoviedb.org/movie/213"
  },
  {
    "date": "2014-08-12",
    "name": "風立ちぬ",
    "published": "2013",
    "id": "tmdb:149870",
    "photo": "https://image.tmdb.org/t/p/original/jfwSexzlIzaOgxP9A8bTA6t8YYb.jpg",
    "content": "A lifelong love of flight inspires Japanese aviation engineer Jiro Horikoshi, whose storied career includes the creation of the A-6M World War II fighter plane.",
    "url": "https://themoviedb.org/movie/149870"
  },
  {
    "date": "2014-08-12",
    "name": "Calvary",
    "published": "2014",
    "id": "tmdb:157832",
    "photo": "https://image.tmdb.org/t/p/original/lx4eEDHLM5OP3JgjwkVic6bsSGV.jpg",
    "content": "After being threatened during a confession, a good-natured priest must battle the dark forces closing in around him.",
    "url": "https://themoviedb.org/movie/157832"
  },
  {
    "date": "2014-08-12",
    "name": "The Immigrant",
    "published": "2013",
    "id": "tmdb:152599",
    "photo": "https://image.tmdb.org/t/p/original/ArWRRQYeXL3nG4jYpMOPoBvgmy9.jpg",
    "content": "1921 New York. An immigrant woman is tricked into a life of burlesque and vaudeville until a dazzling magician tries to save her and reunite her with her sister who is being held in the confines of Ellis Island.",
    "url": "https://themoviedb.org/movie/152599"
  },
  {
    "date": "2014-08-12",
    "name": "Kill Your Darlings",
    "published": "2013",
    "id": "tmdb:157370",
    "photo": "https://image.tmdb.org/t/p/original/wYM8VUTh0y6ugSmza1c2MJWCMfO.jpg",
    "content": "A murder in 1944 draws together the great poets of the beat generation: Allen Ginsberg, Jack Kerouac and William Burroughs.",
    "url": "https://themoviedb.org/movie/157370"
  },
  {
    "date": "2014-08-12",
    "name": "My Boy Jack",
    "published": "2007",
    "id": "tmdb:25143",
    "photo": "https://image.tmdb.org/t/p/original/ugsEKXt0VVlUfns0VUUgggFPbmh.jpg",
    "content": "Author Rudyard Kipling and his wife search for their 17-year-old son after he goes missing during WWI.",
    "url": "https://themoviedb.org/movie/25143"
  }
]